#############
## Drivers ##
#############
# cask "logitech-options"
# cask "logitech-g-hub"

########################
## Productivity Tools ##
########################
mas "Microsoft Outlook", id: 985367838
mas "Microsoft OneNote", id: 784801555
mas "Microsoft To Do", id: 1274495053

#####################
## Developer Tools ##
#####################
cask "Xcode", id: 497799835
cask "android-studio"
# brew "azure-cli"
# brew "cocoapods"
cask "amazon-q"
# cask "finch"
cask "flutter"
brew "gh"
# brew "git-flow-avh"
# cask "hyper"
# cask "iterm2"
# cask "microsoft-azure-storage-explorer"
cask "alacritty"
brew "neovim"
brew "pnpm"
# cask "sourcetree"
# brew "tmux"
brew "tree"
cask "visual-studio-code"

################
# Design Tools #
################
cask "figma"
cask "gimp"

###############
## Utilities ##
###############
cask "appcleaner"
brew "exiftool"
# brew "ghostscript"
# brew "imagemagic"
# cask "namechanger"
# cask "maccy"
# brew "postman"
# cask "rectangle"
cask "shottr"
cask "the-unarchiver"
brew "trash-cli"
# cask "vnc-viewer"
# brew "watchman"
brew "yt-dlp"
brew "p7zip"
mas "Windows App", id: 1295203466
# cask "utm"
# cask "crystalfetch" # Download Windows Images
brew "btop" # Upgraded version of top command
# brew "wakeonlan" # WOL
# brew "drawio" # draw diagram

##############
## Security ##
##############
brew "gpg"
cask "1password"
# cask "gpg-suite"
# cask "keybase"
brew "pinentry-mac"

##################
## Web Browsers ##
##################
cask "microsoft-edge"
cask "google-chrome"

###########
## Fonts ##
###########
cask "font-d2coding"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-pretendard"
cask "font-source-code-pro"
cask "font-nanum-gothic"

# Need to previlege
cask "adguard"
