cask_args appdir: '/Applications'

# 'brew tap'
tap "homebrew/cask"

# Programming
#cask 'java'
#brew 'yarn'
#brew 'maven'
#brew 'gradle'
#brew 'vagrant-completion'
#brew 'carthage'
#brew 'rclone'
#brew 'percona-toolkit'
#brew 'watchman'
#brew 'm-cli'
#brew 'python'
brew 'git-flow-avh'
#brew 'springboot'
#brew 'dart'

# Web Browser
cask 'google-chrome'
cask 'homebrew/cask-versions/firefox-developer-edition'
#cask 'firefox'

# Editor
cask 'android-studio'
cask 'visual-studio-code'

# Database Client
cask 'mysqlworkbench'
#cask 'dbeaver-community'
#cask 'staruml'

# Other Developer Tools
cask 'iterm2'
cask 'sourcetree'
cask 'docker'
#cask 'virtualbox'
#cask 'virtualbox-extension-pack'
#cask 'tunnelblick'
cask 'gpg-suite'

# Security
cask 'keybase'

# Drivers
cask 'homebrew/cask-drivers/logitech-options'

# Utilities
cask 'shiftit'
cask 'appcleaner'
cask 'namechanger'
cask 'android-file-transfer'
#cask 'playmemories-home'

# Cloud Drive
cask 'google-drive-file-stream'

# Graphic Design
cask 'gimp'
#cask 'zeplin'
#cask 'imaging-edge'

# Chatting
cask 'slack'

# Security
cask 'veracrypt'

# Fonts
cask 'font-dejavu-sans-mono-nerd-font'
cask 'homebrew/cask-fonts/font-source-code-pro'
cask 'font-fira-code-nerd-font'
cask 'font-d2coding'
cask 'font-jetbrains-mono-nerd-font'
