tap "homebrew/cask"
tap "homebrew/cask-fonts"

# drivers
cask "logitech-options"
cask "logitech-g-hub"

# collaboration
#cask "microsoft-teams"
cask "figma"

# development
cask "docker"
cask "iterm2"
cask "visual-studio-code"
cask "sourcetree"
cask "microsoft-azure-storage-explorer"
brew "git-flow-avh"
brew "nvm"
brew "azure-cli"

# utility
cask "shiftit"
cask "appcleaner"
cask "namechanger"
cask "the-unarchiver"
brew "watchman"
brew "postman"
brew "ghostscript"

# security
cask "adguard"
cask "1password"
cask "gpg-suite"
cask "keybase"

# web browser
cask "microsoft-edge"
cask "google-chrome"
cask "firefox-developer-edition"

# font
cask "font-source-code-pro"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-d2coding"
cask "font-jetbrains-mono-nerd-font"
