tap "homebrew/cask"
tap "homebrew/cask-fonts"

# drivers
cask "logitech-options"

# development
cask "iterm2"
cask "visual-studio-code-insiders"

# utility
cask "shiftit"
cask "appcleaner"
cask "namechanger"

# security
cask "1password"
cask "gpg-suite"
cask "keybase"

# web browser
cask "microsoft-edge"
cask "google-chrome"
cask "firefox-developer-edition"

# font
cask "font-source-code-pro"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-d2coding"
cask "font-jetbrains-mono-nerd-font"
