tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"

# drivers
cask "logitech-options"
cask "logitech-g-hub"

# collaboration
#cask "microsoft-teams"
cask "figma"
cask "google-drive"

# development
#brew "alacritty"
brew "azure-cli"
# cask "docker"
brew "docker"
brew "docker-compose"
cask "fig"
brew "gh"
brew "git-flow-avh"
cask "hyper"
#cask "iterm2"
brew "lima"
cask "microsoft-azure-storage-explorer"
cask "microsoft-openjdk11"
brew "neovim"
#brew "nvm"
brew "pnpm"
cask "sourcetree"
#brew "tmux"
brew "tree"
cask "visual-studio-code"

# utility
#cask "shiftit"
cask "rectangle"
cask "appcleaner"
cask "namechanger"
#cask "betterdisplay"
#cask "the-unarchiver"
#brew "watchman"
brew "postman"
#brew "ghostscript"
#brew "defaultbrowser"
cask "shottr"
#brew "imagemagic"
brew "trash"
cask "maccy"
cask "vnc-viewer"

# security
brew "gpg"
cask "adguard"
cask "1password"
#cask "gpg-suite"
cask "keybase"
brew "pinentry-mac"

# web browser
cask "microsoft-edge"
cask "google-chrome"
cask "firefox-developer-edition"

# font
cask "font-d2coding"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-pretendard"
cask "font-source-code-pro"
