tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-drivers"
tap "homebrew/cask-versions"

# drivers
cask "logitech-options"
cask "logitech-g-hub"

# collaboration
# cask "microsoft-teams"
cask "figma"
cask "google-drive"

# development
brew "alacritty"
brew "azure-cli"
cask "docker"
cask "fig"
brew "gh"
brew "git-flow-avh"
cask "iterm2"
cask "microsoft-azure-storage-explorer"
brew "neovim"
# brew "nvm"
cask "sourcetree"
brew "tmux"
brew "tree"
cask "visual-studio-code"

# utility
cask "shiftit"
cask "appcleaner"
cask "namechanger"
cask "betterdisplay"
# cask "the-unarchiver"
brew "watchman"
brew "postman"
# brew "ghostscript"
# brew "defaultbrowser"
brew "shottr"
brew "imagemagic"
brew "trash"

# security
cask "adguard"
cask "1password"
cask "gpg-suite"
cask "keybase"

# web browser
cask "microsoft-edge"
cask "google-chrome"
cask "firefox-developer-edition"

# font
cask "font-source-code-pro"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-d2coding"
cask "font-jetbrains-mono-nerd-font"
